STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/ROT/OEMiROT_Boot/Src/boot_hal.c
    /* Check Flow control */
    FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_5_L);
    uFlowStage = FLOW_STAGE_CHK;

    /* Second function call to resist to basic hardware attacks */
    LL_SECU_UpdateLoaderRunTimeProtections();

    /* Check Flow control */
    FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_6_L);

    /* set the secure vector */
    SCB->VTOR = (uint32_t)LOADER_S_CODE_START;

    /* Lock Secure Vector Table */
    SYSCFG->CSLCKR |= SYSCFG_CSLCKR_LOCKSVTAIRCR;
    /*  change stack limit  */
    __set_MSPLIM(0);
    /* Restore the Main Stack Pointer Limit register's reset value
     * before passing execution to runtime firmware to make the
     * bootloader transparent to it.
     */
    __set_MSP(vt->msp);
    __DSB();
    __ISB();
    boot_jump_to_next_image((uint32_t)&boot_jump_to_next_image, vt->reset);
#else
    static struct boot_arm_vector_table *vt = (struct boot_arm_vector_table *)LOADER_NS_CODE_START;

    /* Check Flow control */
    FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_4_L);
    uFlowStage = FLOW_STAGE_CFG;

    /* Update run time protections for application execution */
    LL_SECU_UpdateLoaderRunTimeProtections();

    /* Check Flow control */
    FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_5_L);
    uFlowStage = FLOW_STAGE_CHK;

    /* Second function call to resist to basic hardware attacks */
    LL_SECU_UpdateLoaderRunTimeProtections();

    /* Check Flow control */
    FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STAGE_6_L);

    /* set the vector */
    SCB_NS->VTOR = LOADER_NS_CODE_START;

    /* Lock Secure Vector Table */
    SYSCFG->CSLCKR |= SYSCFG_CSLCKR_LOCKSVTAIRCR;
    /* Set non-secure main stack (MSP_NS) */
    __TZ_set_MSP_NS((*(uint32_t *)LOADER_NS_CODE_START));
    /* the function erase all internal SRAM , and unsecure all SRAM to adapt to any non secure loader mapping */
    boot_jump_to_next_image((uint32_t)&boot_jump_to_ns_image,vt->reset);
#endif /* defined(MCUBOOT_PRIMARY_ONLY) */

    /* Avoid compiler to pop registers after having changed MSP */
#if !defined(__ICCARM__)
    __builtin_unreachable();
#else
    while (1);
#endif /* defined(__ICCARM__) */
}

/* Continue to place code in a specific section */
#if defined(__GNUC__)
__attribute__((section(".BL2_NoHdp_Code")))
#endif /* __GNUC__ */

/*!
 * \brief Chain-loading the next image in the boot sequence.
 *
 * This function calls the Reset_Handler of the next image in the boot sequence,
 * usually it is the secure firmware. Before passing the execution to next image
 * there is conditional rule to remove the secrets from the memory. This must be
 * done if the following conditions are satisfied:
 *  - Memory is shared between SW components at different stages of the trusted
 *    boot process.
 *  - There are secrets in the memory: KDF parameter, symmetric key,
 *    manufacturer sensitive code/data, etc.
 */
__attribute__((naked)) void boot_jump_to_ns_image(uint32_t reset_handler_addr)
{
    __ASM volatile(
#if !defined(__ICCARM__)
        ".syntax unified                 \n"
#endif /* !defined(__ICCARM__) */
        "mov     r7, r0                  \n"
        "bl      boot_clean_ns_ram_area  \n" /* Clean all RAM and unsecure all before jump */
        "movs    r0, #0                  \n" /* Clear registers: R0-R12, */
        "mov     r1, r0                  \n" /* except R7 */
        "mov     r2, r0                  \n"
        "mov     r3, r0                  \n"
        "mov     r4, r0                  \n"
        "mov     r5, r0                  \n"
        "mov     r6, r0                  \n"
        "mov     r8, r0                  \n"
        "mov     r9, r0                  \n"
        "mov     r10, r0                 \n"
        "mov     r11, r0                 \n"
        "mov     r12, r0                 \n"
        "mov     lr,  r0                 \n"
        "bic.w   r7, r7, #1              \n"
        "blxns   r7                      \n" /* Jump to non secure Reset_handler */
    );
}
/* Stop placing data in specified section */
#if defined(__ICCARM__)
#pragma default_function_attributes =
#endif /* __ICCARM__ */

#endif /* MCUBOOT_EXT_LOADER */
#if defined(__ICCARM__)
#pragma default_function_attributes = @ ".BL2_NoHdp_Code"
#elif defined(__CC_ARM)
#pragma arm section code = ".BL2_NoHdp_Code"
#else
__attribute__((section(".BL2_NoHdp_Code")))
#endif /* __ICCARM__ */
__attribute__((naked)) void boot_jump_to_next_image(uint32_t boot_jump_addr, uint32_t reset_handler_addr)
{
    __ASM volatile(
#if !defined(__ICCARM__)
        ".syntax unified                 \n"
#endif
        "mov     r7, r0                  \n"
        "mov     r8, r1                  \n"
        "bl      boot_clear_bl2_ram_area \n" /* Clear RAM before jump */
        "movs    r0, #0                  \n" /* Clear registers: R0-R12, */
        "mov     r1, r0                  \n" /* except R7 */
        "mov     r2, r0                  \n"
        "mov     r3, r0                  \n"
        "mov     r4, r0                  \n"
        "mov     r5, r0                  \n"
        "mov     r6, r0                  \n"
        "mov     r9, r0                  \n"
        "mov     r10, r0                 \n"
        "mov     r11, r0                 \n"
        "mov     r12, r0                 \n"
        "mov     lr,  r0                 \n"
        "mov     r0, r8                  \n"
        "mov     r8, r1                  \n"
        "bx      r7                      \n" /* Jump to Reset_handler */
    );
}
/* Stop placing data in specified section */
#if defined(__ICCARM__)
#pragma default_function_attributes =
#elif defined(__CC_ARM)
#pragma arm section code
#endif /* __ICCARM__ */
/* Place code in a specific section */
#if defined(__ICCARM__)
#pragma default_function_attributes = @ ".BL2_NoHdp_Code"
#else
__attribute__((section(".BL2_NoHdp_Code")))
#endif /* __ICCARM__ */

#if defined(OEMIROT_FAST_WAKE_UP)
/**
  * @brief This function checks if system wakes-up from low-power mode:
  *        Stand-by mode and shut down mode (depending on HW capability)
  * @note
  * @retval FIH_SUCCESS in case of wake-up
  */
fih_int boot_platform_wakeup(void)
{
    fih_int fih_rc = FIH_FAILURE;

    /* Check Stand-By Flag */
    if (__HAL_PWR_GET_FLAG(PWR_FLAG_SBF))
    {
        fih_rc = FIH_SUCCESS;
    }

    FIH_RET(fih_rc);
}
#endif /* OEMIROT_FAST_WAKE_UP */

